Revit 2027 API
ViewSchedule.GetStripedRowsColor Method
 Gets the color applied to part of the pattern for a schedule with striped rows.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color GetStripedRowsColor(
	StripedRowPattern index
)
Public Function GetStripedRowsColor (
	index As StripedRowPattern
) As Color
public:
Color^ GetStripedRowsColor(
	StripedRowPattern index
)
member GetStripedRowsColor :
        index : StripedRowPattern -> Color
Parameters
index StripedRowPattern
 The part of the striped row pattern.
Return Value
Color
 The applied color of the pattern part.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace